# Shell and CLI essentials
brew "bash-completion"
brew "bat"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "jq"
brew "k9s"
brew "kcat"
brew "kubernetes-cli"
brew "lazygit"
brew "lsd"
brew "openjdk"
brew "maven"
brew "neovim"
brew "node"
brew "openjdk@17"
brew "pipx"
brew "python@3.12", link: false
brew "rbenv"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"

# Language runtimes and build tooling
brew "maven"
brew "neovim"
brew "node"
brew "openjdk"
brew "openjdk@17"
brew "pipx"
brew "python@3.12", link: false
brew "rbenv"
brew "tmux"
brew "vim"

# Desktop applications
cask "alacritty"
cask "amethyst"
cask "font-fira-code-nerd-font"
cask "karabiner-elements"
cask "quitter"
cask "spotify"
cask "visual"
cask "visual-studio-code"

# VS Code extensions
vscode "dionannd.tokyo-night-ported-nvim"
vscode "docker.docker"
vscode "google-cloud-spanner-ecosystem.google-cloud-spanner-driver"
vscode "henrytsz.nvim"
vscode "jinmingjian.sde"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "mtxr.sqltools"
vscode "oracle.oracle-java"
vscode "redhat.java"
vscode "shubhsharma.lazyvim-theme"
vscode "sswg.swift-lang"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vknabel.vscode-apple-swift-format"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "zhang-renyang.vscode-react"
