# Taps
tap "ajrosen/tap"
tap "antoniorodr/memo"
tap "eddmann/tap"
tap "oven-sh/bun"
tap "steipete/tap"
tap "yakitrak/yakitrak"

# Shell and CLI essentials
brew "bash-completion"
brew "bat"
brew "cloudflared"
brew "cocoapods"
brew "docker"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "jq"
brew "k9s"
brew "kcat"
brew "kubernetes-cli"
brew "lazygit"
brew "lsd"
brew "openjdk"
brew "maven"
brew "neovim"
brew "node"
brew "openjdk@17"
brew "pipx"
brew "podman"
brew "postgresql@16", link: true
brew "python@3.12"
brew "rbenv"
brew "ripgrep"
brew "sshpass"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "unar"
brew "vim"
brew "watch"
brew "wimlib"

# Tools from taps
brew "ajrosen/tap/icalpal"
brew "antoniorodr/memo/memo"
brew "eddmann/tap/strava-cli"
brew "oven-sh/bun/bun"
brew "steipete/tap/goplaces"
brew "steipete/tap/imsg"
brew "steipete/tap/remindctl"
brew "steipete/tap/summarize"
brew "yakitrak/yakitrak/obsidian-cli"

# Desktop applications
cask "alacritty"
cask "amethyst"
cask "balenaetcher"
cask "copilot-cli"
cask "docker-desktop"
cask "excalidrawz"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "maccy"
cask "microsoft-outlook"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "quitter"
cask "spotify"
cask "steam"
cask "telegram-desktop"
cask "visual"
cask "visual-studio-code"
cask "zwift"

# VS Code extensions
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "dionannd.tokyo-night-ported-nvim"
vscode "docker.docker"
vscode "github.github-vscode-theme"
vscode "google-cloud-spanner-ecosystem.google-cloud-spanner-driver"
vscode "henrytsz.nvim"
vscode "jinmingjian.sde"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "mtxr.sqltools"
vscode "oracle.oracle-java"
vscode "redhat.java"
vscode "shubhsharma.lazyvim-theme"
vscode "sswg.swift-lang"
vscode "swiftlang.swift-vscode"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vknabel.vscode-apple-swift-format"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"